an1r6dh/MINING/central_hub_esp32s3_v6.ino
/**
 * ====================================================================================================
 * PROJECT: INTRINSICALLY SAFE REAL-TIME MINE SUBSIDENCE MONITORING & EARLY WARNING (SIH 26025)
 * FIRMWARE: ESP32-S3 Central Master Hub (central_hub_esp32s3_v6.ino)
 * TARGET: ESP32-S3 Development Board (Arduino IDE Compilable)
 * ====================================================================================================
 * 
 * AUDIT & ENGINEERING REVISIONS (VERSION 6.0 PRODUCTION HARDENED):
 * 1. Unified Buzzer Management & Dual-Core Race Condition Elimination (CRITICAL):
 *    - Core 0 (vGsmSmsTask) previously called digitalWrite(PIN_BUZZER, HIGH/LOW) with blocking vTaskDelay,
 *      which conflicted with Core 1's continuous handleBuzzerAlerts() in loop(), causing pin contention
 *      and instantaneous silencing of warning beeps.
 *    - All physical buzzer writes are now strictly unified on Core 1. Core 0 requests warning beeps via
 *      a non-blocking thread-safe counter (gsmWarningBeepsRemaining).
 * 2. Hardened Cellular Network Registration (AT+CREG?) Response Parser (CRITICAL):
 *    - Replaced the fragile single-shot 300ms delay with an active response collector loop (up to 1500ms)
 *      that verifies complete modem frames ("OK", "+CREG:"). Handles home (1) and roaming (5) across all
 *      solicited/unsolicited formats (e.g. "+CREG: 0,1", "+CREG: 1,1", "+CREG: 0,5", "+CREG: 1").
 *    - Added automatic retry before declaring network out-of-coverage, preventing dropped emergency SMS.
 * 3. SMS Prompt Timeout Escape Recovery (0x1B ESC):
 *    - If the modem prompt ('>') is not received within 5000ms, the routine sends 0x1B (ESC) to cleanly
 *      abort the SMS input session, preventing subsequent AT commands from being swallowed as SMS body text.
 * 4. Non-Blocking USB-CDC Serial Command Engine (TDMA Protection):
 *    - Replaced Serial.readStringUntil('\n') (which blocked up to 1000ms) with a zero-latency static byte
 *      accumulator. Eliminates TDMA superframe jitter and ensures sub-millisecond beacon clock precision.
 * 5. Geotechnical Vibration Threshold Detection (Node 1 & Node 2):
 *    - Defined CRITICAL_VIBRATION_THRESH_G (0.8f). Now checks filtered_vibration alongside tilt and displacement.
 *    - Node 2's SW-420 tripwire vibration latch (1.0f) and Node 1 dynamic seismic shocks now reliably trip alarms.
 * 6. Tripwire Alarm Latching:
 *    - Critical alarms are latched upon breach. Momentary tripwire triggers (e.g., SW-420 single-frame pulses)
 *      will not be silenced on the subsequent packet until an operator or upstream AI issues a "RESET" command.
 * 7. AI Hardware Server Interrupt (GPIO 10) Debouncing:
 *    - Added millisecond time-guard debouncing in handleServerInterruptISR() to prevent contact bounce or RF noise
 *      from flooding the FreeRTOS gsmQueue with duplicate emergency dispatches.
 * 8. 1D Discrete Kalman Initial State Auto-Seeding:
 *    - The ultrasonic displacement Kalman filter auto-seeds its initial state with the first valid reading,
 *      eliminating filter startup lag and false displacement breach transients.
 * 9. Dual-Core Memory Consistency:
 *    - All variables shared across Core 0 and Core 1 / ISR are qualified as volatile with atomic operations.
 * 10. Multi-IDF ESP-NOW Compatibility:
 *    - Supports ESP-IDF v4.x (Arduino Core 2.x) and ESP-IDF v5.x (Arduino Core 3.x) with strict callback casting.
 * ====================================================================================================
 */

#include <Arduino.h>
#include <esp_now.h>
#include <WiFi.h>
#include <esp_wifi.h> // Explicit Wi-Fi Hardware Channel Configuration

// Set to 1 to enable optional I2C 16x2 LCD display (Requires LiquidCrystal_I2C library)
#define ENABLE_I2C_LCD          0

#if ENABLE_I2C_LCD
#include <Wire.h>
#include <LiquidCrystal_I2C.h>
#define PIN_I2C_SDA             8    // ESP32-S3 hardware I2C SDA
#define PIN_I2C_SCL             9    // ESP32-S3 hardware I2C SCL
#define LCD_I2C_ADDR            0x27 // Default PCF8574 backpack address
#define LCD_COLS                16
#define LCD_ROWS                2
#define LCD_REFRESH_INTERVAL_MS 250
#define LCD_ROTATE_INTERVAL_MS  2000
#endif

/* ====================================================================================================
 * 1. HARDWARE PIN DEFINITIONS (ESP32-S3 SPECIFIC)
 * ==================================================================================================== */
#define PIN_LED_RED_POWER       11   // Power LED (Continuously driven HIGH in setup)
#define PIN_LED_GREEN_STATUS    13   // Status LED (Solid = Nodes 1 & 2 synced; Rapid blink = timeout)
#define PIN_BUZZER              4    // High-pitch alarm buzzer (Active buzzer or PWM drive)

#define PIN_SERVER_INTERRUPT    10   // AI Server Hardware Interrupt (Active LOW with internal pull-up)

#define PIN_GSM_RX              18   // ESP32-S3 RX1 -> connected to SIM module TX
#define PIN_GSM_TX              17   // ESP32-S3 TX1 -> connected to SIM module RX

/* ====================================================================================================
 * 2. SYSTEM CONFIGURATION & SAFETY THRESHOLDS
 * ==================================================================================================== */
#define ESPNOW_WIFI_CHANNEL         1               // Channel for ESP-NOW TDMA cluster (RF Locked)
#define EMERGENCY_PHONE_NUMBER      "+919876543210" // Destination phone number for SMS alerts

#define CRITICAL_DISPLACEMENT_THRESH_MM 15.0f       // Critical rock mass displacement trigger (mm)
#define CRITICAL_TILT_THRESH_DEG        5.0f        // Critical angular tilt trigger (degrees)
#define CRITICAL_VIBRATION_THRESH_G     0.8f        // Critical vibration threshold (g) - catches SW-420 & dynamic shock
#define NODE_TIMEOUT_MS                 3500        // Timeout threshold before marking a node offline

#define TDMA_FRAME_PERIOD_MS        1000            // Master TDMA superframe period (1000 ms)
#define TDMA_SLOT_DURATION_MS       80              // Transmit window duration per node (80 ms)
#define STATUS_BLINK_INTERVAL_MS    150             // Rapid blink rate when any demo node times out
#define SMS_COOLDOWN_MS             60000           // 60s cooldown between automated threshold SMS sends
#define ISR_DEBOUNCE_GUARD_MS       1000            // Debounce guard for AI Server hardware interrupt

