an1r6dh/MINING/central_hub_esp32s3_v6.ino
/* ====================================================================================================
 * 3. EMBEDDED 1D DISCRETE KALMAN FILTER ENGINE
 * ==================================================================================================== */
class DiscreteKalmanFilter1D {
public:
    DiscreteKalmanFilter1D(float process_noise = 0.02f, float measurement_noise = 1.5f, float estimation_error = 1.0f, float initial_value = 0.0f)
        : _q(process_noise), _r(measurement_noise), _p(estimation_error), _x(initial_value), _k(0.0f), _initialized(false) {}

    float update(float measurement) {
        if (!_initialized) {
            _x = measurement;
            _initialized = true;
            return _x;
        }
        _p = _p + _q;
        float denominator = _p + _r;
        _k = (fabs(denominator) > 1e-6f) ? (_p / denominator) : 0.5f;
        _x = _x + _k * (measurement - _x);
        _p = (1.0f - _k) * _p;
        return _x;
    }

    void reset(float initial_value = 0.0f) {
        _x = initial_value;
        _p = 1.0f;
        _initialized = false;
    }

    float getState() const { return _x; }
    void setNoiseParameters(float q, float r) { _q = q; _r = r; }

private:
    float _q;
    float _r;
    float _p;
    float _x;
    float _k;
    bool  _initialized;
};

/* ====================================================================================================
 * 4. PROTOCOL DATA STRUCTURES (EXACT PACKED BINARY PAYLOADS)
 * ==================================================================================================== */
#define PKT_TYPE_BEACON    0x01
#define PKT_TYPE_TELEMETRY 0x02

struct __attribute__((packed)) TDMABeaconPacket {
    uint8_t  msg_type;           // PKT_TYPE_BEACON (0x01)
    uint32_t frame_id;          // Monotonically increasing frame counter
    uint32_t beacon_time_ms;    // Master clock timestamp
    uint16_t slot_duration_ms;  // Slot duration (80ms)
    uint8_t  total_slots;       // Number of active slots in frame
    uint8_t  emergency_flag;    // 1 if alarm active, 0 normal
};

struct __attribute__((packed)) SensorPayload {
    uint8_t  msg_type;          // PKT_TYPE_TELEMETRY (0x02)
    uint8_t  node_id;           // 1 = Node 1, 2 = Node 2
    float    tilt;              // Raw Tilt angle (degrees)
    float    vibration;         // Raw Vibration acceleration (g)
    float    displacement;      // Raw Surface/Roof displacement (mm)
};

struct FilteredNodeRecord {
    bool     active;
    uint32_t last_packet_time;
    float    raw_tilt;
    float    raw_vibration;
    float    raw_displacement;
    float    filtered_tilt;
    float    filtered_vibration;
    float    filtered_displacement;
};

struct SmsAlertRequest {
    char message[140];
};

/* ====================================================================================================
 * 5. GLOBAL OBJECTS, FREERTOS HANDLES & PER-NODE KALMAN ARRAYS
 * ==================================================================================================== */
uint8_t broadcastAddress[] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

HardwareSerial SerialGSM(1);
QueueHandle_t gsmQueue = NULL;

#if ENABLE_I2C_LCD
LiquidCrystal_I2C lcd(LCD_I2C_ADDR, LCD_COLS, LCD_ROWS);
bool lcdAvailable = false;
uint32_t lastLcdUpdateTime = 0;
uint32_t lastLcdRotateTime = 0;
uint8_t  currentLcdDisplayNode = 1;
#endif

#define MAX_SUPPORTED_NODES 3 // Index 0 unused, Index 1 = Node 1, Index 2 = Node 2

// Dedicated 1D Kalman Filter instances for Node 1
DiscreteKalmanFilter1D kfTilt[MAX_SUPPORTED_NODES] = {
    DiscreteKalmanFilter1D(0.02f, 1.5f),
    DiscreteKalmanFilter1D(0.02f, 1.5f), // Node 1 Tilt
    DiscreteKalmanFilter1D(0.02f, 1.5f)  // Node 2 (Bypassed)
};

DiscreteKalmanFilter1D kfVibration[MAX_SUPPORTED_NODES] = {
    DiscreteKalmanFilter1D(0.05f, 2.0f),
    DiscreteKalmanFilter1D(0.05f, 2.0f), // Node 1 Vibration
    DiscreteKalmanFilter1D(0.05f, 2.0f)  // Node 2 (Bypassed)
};

DiscreteKalmanFilter1D kfDisplacement[MAX_SUPPORTED_NODES] = {
    DiscreteKalmanFilter1D(0.01f, 0.8f),
    DiscreteKalmanFilter1D(0.01f, 0.8f), // Node 1 Ultrasonic Displacement (Auto-seeding)
    DiscreteKalmanFilter1D(0.01f, 0.8f)  // Node 2 (Bypassed)
};

FilteredNodeRecord nodes[MAX_SUPPORTED_NODES];

// System State & Non-Blocking Timers
uint32_t tdmaFrameId = 0;
uint32_t lastBeaconTxTime = 0;
uint32_t lastBlinkTime = 0;
bool     greenLedState = false;
uint32_t lastAutoSmsDispatchTime = 0;

// Dual-Core Thread-Safe Concurrency Flags
volatile bool serverInterruptTriggered = false;
volatile bool criticalAlarmActive = false;
volatile uint32_t lastIsrTriggerTime = 0;

// Unified Buzzer Control (Core 1 Ownership, Core 0 Signaling)
volatile uint8_t gsmWarningBeepStepsRemaining = 0; // Each beep = 1 ON step + 1 OFF step (6 steps = 3 beeps)
uint32_t lastBuzzerStepTime = 0;

/* ====================================================================================================
 * 6. FORWARD DECLARATIONS
 * ==================================================================================================== */
void vGsmSmsTask(void *pvParameters);
void sendSMSAlertBlocking(const char* alertMessage);
void triggerSmsAlert(const char* alertMsg);
void requestGsmWarningBeeps(uint8_t numBeeps);
void IRAM_ATTR handleServerInterruptISR();
void processIncomingData(const SensorPayload& payload);
void broadcastTDMABeacon();
void initHardware();
void initESPNowTDMA();
bool areAllDemoNodesSynced();
void updateStatusLEDs();
void handleBuzzerAlerts();
void checkSerialCommands();
#if ENABLE_I2C_LCD
void lcdPrintPaddedLine(uint8_t row, const char* text);
void updateLCDDisplay();
#endif

/* ====================================================================================================
 * 7. HARDWARE INTERRUPT SERVICE ROUTINE (ISR) FOR AI SERVER
 * ==================================================================================================== */
void IRAM_ATTR handleServerInterruptISR() {
    uint32_t now = millis();
    // Millisecond debounce guard prevents contact bounce or EMI from flooding the FreeRTOS queue
    if (now - lastIsrTriggerTime < ISR_DEBOUNCE_GUARD_MS) {
        return;
    }
    lastIsrTriggerTime = now;
    serverInterruptTriggered = true;

    if (gsmQueue != NULL) {
        SmsAlertRequest req;
        const char* msg = "EMERGENCY: AI Model predicts mine subsidence event! Evacuate Sector B!";
        strncpy(req.message, msg, sizeof(req.message) - 1);
        req.message[sizeof(req.message) - 1] = '\0';
        
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        xQueueSendFromISR(gsmQueue, &req, &xHigherPriorityTaskWoken);
        if (xHigherPriorityTaskWoken) {
            portYIELD_FROM_ISR();
        }
    }
}

