an1r6dh/MINING/central_hub_esp32s3_v6.ino
/* ====================================================================================================
 * 8. FREERTOS CORE 0 CELLULAR GSM TASK (NON-BLOCKING BACKGROUND DISPATCH)
 * ==================================================================================================== */
void requestGsmWarningBeeps(uint8_t numBeeps) {
    // 2 state changes per beep: ON then OFF
    gsmWarningBeepStepsRemaining = numBeeps * 2;
}

void vGsmSmsTask(void *pvParameters) {
    Serial.println("[FreeRTOS Core 0] GSM Background Task initialized.");
    SmsAlertRequest request;

    while (true) {
        if (xQueueReceive(gsmQueue, &request, portMAX_DELAY) == pdTRUE) {
            Serial.println("\n[FreeRTOS Core 0] ALERT IN QUEUE! Starting SMS dispatch...");
            sendSMSAlertBlocking(request.message);
            Serial.println("[FreeRTOS Core 0] SMS Dispatch complete. Returning to idle.\n");
        }
    }
}

/**
 * Robust AT response reader with configurable timeout and termination search
 */
bool waitForGsmResponse(const char* expected1, const char* expected2, uint32_t timeoutMs, String* outResponse = NULL) {
    uint32_t start = millis();
    String resp = "";
    while (millis() - start < timeoutMs) {
        while (SerialGSM.available()) {
            char c = SerialGSM.read();
            resp += c;
        }
        if (expected1 && resp.indexOf(expected1) != -1) {
            if (outResponse) *outResponse = resp;
            return true;
        }
        if (expected2 && resp.indexOf(expected2) != -1) {
            if (outResponse) *outResponse = resp;
            return true;
        }
        if (resp.indexOf("ERROR") != -1) {
            if (outResponse) *outResponse = resp;
            return false;
        }
        vTaskDelay(pdMS_TO_TICKS(20));
    }
    if (outResponse) *outResponse = resp;
    return false;
}

void sendSMSAlertBlocking(const char* alertMessage) {
    // Drain any stale bytes from UART RX buffer
    while (SerialGSM.available()) SerialGSM.read();

    // 1. Check Network Registration Status with active polling
    bool isRegistered = false;
    for (int attempt = 0; attempt < 2; attempt++) {
        SerialGSM.println("AT+CREG?");
        String regResp = "";
        waitForGsmResponse("OK", "+CREG:", 1500, &regResp);

        // Registered Home (+CREG: 0,1 / 1,1) or Registered Roaming (+CREG: 0,5 / 1,5)
        if (regResp.indexOf(",1") != -1 || regResp.indexOf(",5") != -1 ||
            regResp.indexOf(", 1") != -1 || regResp.indexOf(", 5") != -1 ||
            regResp.indexOf(": 1") != -1 || regResp.indexOf(": 5") != -1) {
            isRegistered = true;
            break;
        }
        vTaskDelay(pdMS_TO_TICKS(500));
    }

    if (!isRegistered) {
        Serial.println("\n[GSM CRITICAL FAILURE] SIM module is OUT OF COVERAGE or UNREGISTERED!");
        Serial.println("[GSM ALERT] Unable to deliver SMS due to lack of network signal.");
        // Notify Core 1 to sound 3 warning beeps without GPIO pin race
        requestGsmWarningBeeps(3);
        return;
    }

    // 2. Configure SMS Text Mode
    while (SerialGSM.available()) SerialGSM.read();
    SerialGSM.println("AT+CMGF=1");
    waitForGsmResponse("OK", NULL, 1000);

    // 3. Initiate SMS transmission
    SerialGSM.print("AT+CMGS=\"");
    SerialGSM.print(EMERGENCY_PHONE_NUMBER);
    SerialGSM.println("\"");

    // 4. Wait for '>' prompt with timeout guard
    uint32_t promptTimeout = millis();
    bool promptReceived = false;
    while (millis() - promptTimeout < 5000) {
        if (SerialGSM.available()) {
            char c = SerialGSM.read();
            if (c == '>') {
                promptReceived = true;
                break;
            }
        }
        vTaskDelay(pdMS_TO_TICKS(10));
    }

    if (!promptReceived) {
        Serial.println("[GSM ERROR Core 0] Prompt '>' not received! Aborting SMS session.");
        SerialGSM.write(0x1B); // Send ESC to abort any hung AT+CMGS session
        vTaskDelay(pdMS_TO_TICKS(200));
        requestGsmWarningBeeps(3);
        return;
    }

    // 5. Send message payload and terminate with Ctrl+Z (0x1A)
    SerialGSM.print(alertMessage);
    vTaskDelay(pdMS_TO_TICKS(100));
    SerialGSM.write(0x1A); // Commit SMS

    // 6. Await carrier delivery confirmation (up to 20 seconds)
    String gsmResponse = "";
    bool sendSuccess = waitForGsmResponse("OK", "+CMGS:", 20000, &gsmResponse);

    if (sendSuccess) {
        Serial.println("[GSM SUCCESS Core 0] Emergency SMS successfully delivered to cellular network!");
    } else {
        Serial.printf("[GSM ERROR Core 0] SMS transmission failed (No Signal/Network Reject): %s\n", gsmResponse.c_str());
        SerialGSM.write(0x1B); // Clean up modem state
        requestGsmWarningBeeps(3);
    }

    // Cleanly flush trailing characters
    vTaskDelay(pdMS_TO_TICKS(200));
    while (SerialGSM.available()) SerialGSM.read();
}

void triggerSmsAlert(const char* alertMsg) {
    if (gsmQueue != NULL) {
        SmsAlertRequest req;
        strncpy(req.message, alertMsg, sizeof(req.message) - 1);
        req.message[sizeof(req.message) - 1] = '\0';
        xQueueSend(gsmQueue, &req, 0); // Non-blocking post from Core 1
    }
}

/* ====================================================================================================
 * 9. TELEMETRY PROCESSING: KALMAN FILTERING (NODE 1) & DIGITAL OVERRIDE (NODE 2)
 * ==================================================================================================== */
void processIncomingData(const SensorPayload& payload) {
    uint8_t id = payload.node_id;
    if (id == 0 || id >= MAX_SUPPORTED_NODES) return;

    nodes[id].active = true;
    nodes[id].last_packet_time = millis();
    nodes[id].raw_tilt = payload.tilt;
    nodes[id].raw_vibration = payload.vibration;
    nodes[id].raw_displacement = payload.displacement;

    if (id == 1) {
        // Continuous Geotechnical Node: Processed through dedicated 1D Kalman Filters
        nodes[1].filtered_tilt = kfTilt[1].update(payload.tilt);
        nodes[1].filtered_vibration = kfVibration[1].update(payload.vibration);
        nodes[1].filtered_displacement = kfDisplacement[1].update(payload.displacement);
    } 
    else if (id == 2) {
        // Discrete Tripwire Node: Direct digital override (bypasses Kalman filter for instant tripping)
        nodes[2].filtered_tilt = payload.tilt;                 
        nodes[2].filtered_vibration = payload.vibration;       
        nodes[2].filtered_displacement = payload.displacement; 
    }
    else {
        nodes[id].filtered_tilt = kfTilt[id].update(payload.tilt);
        nodes[id].filtered_vibration = kfVibration[id].update(payload.vibration);
        nodes[id].filtered_displacement = kfDisplacement[id].update(payload.displacement);
    }

