an1r6dh/MINING/central_hub_esp32s3_v6.ino
    Serial.printf("[NODE %d %s] Tilt: %+05.2f deg | Vib: %04.2f g | Disp: %05.1f mm\n",
                  id, (id == 2 ? "DIGITAL OVERRIDE" : "KALMAN FILTERED"),
                  nodes[id].filtered_tilt, nodes[id].filtered_vibration, nodes[id].filtered_displacement);

    // Multi-criteria safety limit evaluation (Displacement, Angular Tilt, OR Seismic/Tripwire Vibration)
    bool isBreached = (nodes[id].filtered_displacement >= CRITICAL_DISPLACEMENT_THRESH_MM) ||
                      (fabs(nodes[id].filtered_tilt) >= CRITICAL_TILT_THRESH_DEG) ||
                      (nodes[id].filtered_vibration >= CRITICAL_VIBRATION_THRESH_G);

    if (isBreached) {
        criticalAlarmActive = true;
        Serial.printf("[LOCAL ALERT] Node %d breached safety limit! Tilt: %.1f deg, Vib: %.2f g, Disp: %.1f mm\n",
                      id, nodes[id].filtered_tilt, nodes[id].filtered_vibration, nodes[id].filtered_displacement);

        uint32_t now = millis();
        if (now - lastAutoSmsDispatchTime > SMS_COOLDOWN_MS) {
            lastAutoSmsDispatchTime = now;
            char autoAlert[140];
            snprintf(autoAlert, sizeof(autoAlert),
                     "CRITICAL ALERT: Mine Movement at Node %d! Tilt: %.1fdeg, Vib: %.2fg, Disp: %.1fmm.",
                     id, nodes[id].filtered_tilt, nodes[id].filtered_vibration, nodes[id].filtered_displacement);
            triggerSmsAlert(autoAlert);
        }
    } else {
        // Auto-clear sensor alarm: scan all active nodes.
        // If every node is currently within safe limits, clear the alarm and stop the buzzer.
        // NOTE: serverInterruptTriggered (AI prediction) always requires a manual RESET command.
        if (!serverInterruptTriggered) {
            bool anyNodeBreached = false;
            for (int i = 1; i < MAX_SUPPORTED_NODES; i++) {
                if (nodes[i].active) {
                    if ((nodes[i].filtered_displacement >= CRITICAL_DISPLACEMENT_THRESH_MM) ||
                        (fabs(nodes[i].filtered_tilt)  >= CRITICAL_TILT_THRESH_DEG)        ||
                        (nodes[i].filtered_vibration   >= CRITICAL_VIBRATION_THRESH_G)) {
                        anyNodeBreached = true;
                        break;
                    }
                }
            }
            if (!anyNodeBreached) {
                if (criticalAlarmActive) {
                    Serial.println("[SYSTEM] All nodes within safe limits — alarm auto-cleared.");
                }
                criticalAlarmActive = false;
            }
        }
    }
}

/* ====================================================================================================
 * 10. ESP-NOW RECEPTION CALLBACK (CORE 1)
 * ==================================================================================================== */
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
void OnDataRecv(const esp_now_recv_info_t *recv_info, const uint8_t *incomingData, int len) {
#else
void OnDataRecv(const uint8_t *mac_addr, const uint8_t *incomingData, int len) {
#endif
    if (len == sizeof(SensorPayload)) {
        SensorPayload packet;
        memcpy(&packet, incomingData, sizeof(SensorPayload));
        if (packet.msg_type == PKT_TYPE_TELEMETRY) {
            processIncomingData(packet);
        }
    } else {
        Serial.printf("[ESP-NOW WARN] Unknown packet size: %d bytes (Expected %u)\n", 
                      len, (unsigned int)sizeof(SensorPayload));
    }
}

/* ====================================================================================================
 * 11. TDMA PROTOCOL IMPLEMENTATION (MASTER BEACON - CORE 1)
 * ==================================================================================================== */
void broadcastTDMABeacon() {
    TDMABeaconPacket beacon;
    beacon.msg_type = PKT_TYPE_BEACON;
    beacon.frame_id = ++tdmaFrameId;
    beacon.beacon_time_ms = millis();
    beacon.slot_duration_ms = TDMA_SLOT_DURATION_MS;
    beacon.total_slots = MAX_SUPPORTED_NODES;
    beacon.emergency_flag = (criticalAlarmActive || serverInterruptTriggered) ? 1 : 0;

    esp_err_t result = esp_now_send(broadcastAddress, (uint8_t *)&beacon, sizeof(beacon));
    if (result != ESP_OK) {
        Serial.printf("[TDMA] Beacon broadcast error: 0x%X\n", result);
    }
}

/* ====================================================================================================
 * 12. HARDWARE & PERIPHERAL INITIALIZATION (CORE 1)
 * ==================================================================================================== */
void initHardware() {
    pinMode(PIN_LED_RED_POWER, OUTPUT);
    pinMode(PIN_LED_GREEN_STATUS, OUTPUT);
    digitalWrite(PIN_LED_RED_POWER, HIGH);  // Continuous HIGH power indicator
    digitalWrite(PIN_LED_GREEN_STATUS, LOW);

    pinMode(PIN_BUZZER, OUTPUT);
    digitalWrite(PIN_BUZZER, LOW);

    pinMode(PIN_SERVER_INTERRUPT, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(PIN_SERVER_INTERRUPT), handleServerInterruptISR, FALLING);

#if ENABLE_I2C_LCD
    Wire.begin(PIN_I2C_SDA, PIN_I2C_SCL);
    Wire.beginTransmission(LCD_I2C_ADDR);
    if (Wire.endTransmission() == 0) {
        lcdAvailable = true;
        lcd.init();
        lcd.backlight();
        lcd.clear();
        lcdPrintPaddedLine(0, "MINE SUBSIDENCE");
        lcdPrintPaddedLine(1, "HUB ON - TDMA CH1");
        Serial.println("[I2C] LCD 16x2 detected and ready.");
    } else {
        lcdAvailable = false;
        Serial.println("[I2C WARN] LCD 16x2 not detected on 0x27.");
    }
#endif

    // Initialize SIM Module UART
    SerialGSM.begin(9600, SERIAL_8N1, PIN_GSM_RX, PIN_GSM_TX);
    delay(1000);

    // Initial AT synchronization handshake (clears boot noise & validates baud)
    for (int i = 0; i < 5; i++) {
        while (SerialGSM.available()) SerialGSM.read();
        SerialGSM.println("AT");
        if (waitForGsmResponse("OK", NULL, 500)) break;
        delay(200);
    }

    SerialGSM.println("ATE0");      // Disable command echo
    waitForGsmResponse("OK", NULL, 300);
    SerialGSM.println("AT+CMGF=1");  // Text mode
    waitForGsmResponse("OK", NULL, 300);

    Serial.println("[GSM] Cellular Serial interface initialized.");
}

void initESPNowTDMA() {
    WiFi.mode(WIFI_STA);
    WiFi.disconnect();

    // Explicitly lock physical Wi-Fi hardware transceiver to Channel 1
    esp_err_t chanErr = esp_wifi_set_channel(ESPNOW_WIFI_CHANNEL, WIFI_SECOND_CHAN_NONE);
    if (chanErr == ESP_OK) {
        Serial.printf("[RF LOCK] Wi-Fi Hardware locked to Channel %d\n", ESPNOW_WIFI_CHANNEL);
    } else {
        Serial.printf("[RF ERROR] Failed to lock Wi-Fi channel: %d\n", chanErr);
    }

