an1r6dh/MINING/central_hub_esp32s3_v6.ino
    if (esp_now_init() != ESP_OK) {
        Serial.println("[ESP-NOW] Critical Init Failure!");
        while (1) delay(1000);
    }

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    esp_now_register_recv_cb((esp_now_recv_cb_t)OnDataRecv);
#else
    esp_now_register_recv_cb((esp_now_recv_cb_t)OnDataRecv);
#endif

    esp_now_peer_info_t peerInfo = {}; // Zero-init defaults ifidx to WIFI_IF_STA (0) on all IDF versions
    memcpy(peerInfo.peer_addr, broadcastAddress, 6);
    peerInfo.channel = ESPNOW_WIFI_CHANNEL;
    peerInfo.encrypt = false;

    if (!esp_now_is_peer_exist(broadcastAddress)) {
        esp_now_add_peer(&peerInfo);
    }
}

/* ====================================================================================================
 * 13. UI & INDICATOR LOGIC (CORE 1)
 * ==================================================================================================== */
bool areAllDemoNodesSynced() {
    uint32_t now = millis();
    bool node1Synced = nodes[1].active && (now - nodes[1].last_packet_time <= NODE_TIMEOUT_MS);
    bool node2Synced = nodes[2].active && (now - nodes[2].last_packet_time <= NODE_TIMEOUT_MS);

    if (!node1Synced) nodes[1].active = false;
    if (!node2Synced) nodes[2].active = false;

    return (node1Synced && node2Synced);
}

void updateStatusLEDs() {
    uint32_t now = millis();
    bool allSynced = areAllDemoNodesSynced();

    if (allSynced) {
        digitalWrite(PIN_LED_GREEN_STATUS, HIGH); // Solid ON when both nodes active & synchronized
    } else {
        if (now - lastBlinkTime >= STATUS_BLINK_INTERVAL_MS) {
            lastBlinkTime = now;
            greenLedState = !greenLedState;
            digitalWrite(PIN_LED_GREEN_STATUS, greenLedState ? HIGH : LOW);
        }
    }
}

/**
 * Non-blocking buzzer state machine owned strictly by Core 1.
 * Handles continuous emergency alarms AND transient GSM failure warning beeps without core fighting.
 */
void handleBuzzerAlerts() {
    uint32_t now = millis();

    // Priority 1: Continuous pulsed alarm for critical subsidence or AI prediction
    if (criticalAlarmActive || serverInterruptTriggered) {
        uint32_t cycle = now % 400;
        digitalWrite(PIN_BUZZER, (cycle < 200) ? HIGH : LOW);
        return;
    }

    // Priority 2: Non-blocking warning beeps signaled by GSM task
    // Steps count DOWN from (numBeeps*2). Even step = Buzzer ON, Odd step = Buzzer OFF.
    // e.g. 3 beeps: steps 6(ON),5(OFF),4(ON),3(OFF),2(ON),1(OFF) -> correct beep-then-silence pattern
    if (gsmWarningBeepStepsRemaining > 0) {
        if (now - lastBuzzerStepTime >= 100) {
            lastBuzzerStepTime = now;
            bool buzzerOn = (gsmWarningBeepStepsRemaining % 2 == 0); // Even step = ON (starts HIGH)
            digitalWrite(PIN_BUZZER, buzzerOn ? HIGH : LOW);
            gsmWarningBeepStepsRemaining--;
        }
        return;
    }

    // Default: Safe state
    digitalWrite(PIN_BUZZER, LOW);
}

#if ENABLE_I2C_LCD
void lcdPrintPaddedLine(uint8_t row, const char* text) {
    if (!lcdAvailable) return;
    char buffer[17];
    snprintf(buffer, sizeof(buffer), "%-16.16s", text);
    lcd.setCursor(0, row);
    lcd.print(buffer);
}

void updateLCDDisplay() {
    if (!lcdAvailable) return;
    uint32_t now = millis();

    if (now - lastLcdRotateTime >= LCD_ROTATE_INTERVAL_MS) {
        lastLcdRotateTime = now;
        currentLcdDisplayNode = (currentLcdDisplayNode == 1) ? 2 : 1;
    }

    if (now - lastLcdUpdateTime < LCD_REFRESH_INTERVAL_MS) return;
    lastLcdUpdateTime = now;

    if (serverInterruptTriggered) {
        lcdPrintPaddedLine(0, "! AI PREDICTION !");
        lcdPrintPaddedLine(1, "EVACUATE MINE NOW");
        return;
    }

    if (criticalAlarmActive) {
        char critLine[17];
        snprintf(critLine, sizeof(critLine), "N%d T:%.0f D:%.0fmm", 
                 currentLcdDisplayNode, 
                 nodes[currentLcdDisplayNode].filtered_tilt, 
                 nodes[currentLcdDisplayNode].filtered_displacement);
        lcdPrintPaddedLine(0, "CRITICAL SUBSIDE");
        lcdPrintPaddedLine(1, critLine);
        return;
    }

    char line0[24];
    char line1[24];
    uint8_t n = currentLcdDisplayNode;

    if (nodes[n].active && (now - nodes[n].last_packet_time <= NODE_TIMEOUT_MS)) {
        snprintf(line0, sizeof(line0), "N%d T:%+04.1f V:%.2f",
                 n, nodes[n].filtered_tilt, nodes[n].filtered_vibration);

        const char* statusTag = (n == 2) ? "[DIG]" : "[OK] ";
        snprintf(line1, sizeof(line1), "D:%04.1fmm %-5s",
                 nodes[n].filtered_displacement, statusTag);
    } else {
        snprintf(line0, sizeof(line0), "NODE %d: TIMEOUT", n);
        snprintf(line1, sizeof(line1), "FRAME #%lu SYNC", (unsigned long)tdmaFrameId);
    }

    lcdPrintPaddedLine(0, line0);
    lcdPrintPaddedLine(1, line1);
}
#endif

/**
 * Completely non-blocking serial command receiver.
 * Accumulates characters until newline without pausing or blocking the TDMA clock.
 */
void checkSerialCommands() {
    static char cmdBuffer[64];
    static uint8_t cmdPos = 0;

    while (Serial.available()) {
        char c = (char)Serial.read();
        if (c == '\n' || c == '\r') {
            if (cmdPos > 0) {
                cmdBuffer[cmdPos] = '\0';
                String cmd = String(cmdBuffer);
                cmd.trim();

                if (cmd.startsWith("ALERT") || cmd.startsWith("INTERRUPT")) {
                    Serial.printf("[AI COMMAND] Emergency alert received: %s\n", cmd.c_str());
                    serverInterruptTriggered = true;
                    triggerSmsAlert("EMERGENCY: AI Model predicts mine subsidence event at Section B! Evacuate!");
                } else if (cmd.equalsIgnoreCase("RESET")) {
                    serverInterruptTriggered = false;
                    criticalAlarmActive = false;
                    gsmWarningBeepStepsRemaining = 0;
                    digitalWrite(PIN_BUZZER, LOW);
                    Serial.println("[SYSTEM] Safety reset acknowledged. Alarms cleared.");
                }

                cmdPos = 0; // Reset buffer
            }
        } else {
            if (cmdPos < sizeof(cmdBuffer) - 1) {
                cmdBuffer[cmdPos++] = c;
            }
        }
    }
}

