an1r6dh/MINING/central_hub_esp32s3_v6.ino
/* ====================================================================================================
 * 14. ARDUINO SETUP (CORE 1 WIRELESS + CORE 0 FREERTOS TASK SPAWN)
 * ==================================================================================================== */
void setup() {
    Serial.begin(115200);
    delay(1000);
    Serial.println("\n[SYSTEM] ESP32-S3 Central Master Hub (central_hub_esp32s3_v6) Booting...");

    // Create FreeRTOS Queue BEFORE attaching interrupts in initHardware()
    gsmQueue = xQueueCreate(5, sizeof(SmsAlertRequest));
    if (gsmQueue != NULL) {
        Serial.println("[FreeRTOS] GSM Message Queue created.");
    }

    // Initialize Hardware & ESP-NOW TDMA
    initHardware();
    initESPNowTDMA();

    // Spawn dedicated GSM SMS worker task PINNED TO CORE 0
    xTaskCreatePinnedToCore(
        vGsmSmsTask,        // Function
        "vGsmSmsTask",      // Name
        4096,               // Stack size
        NULL,               // Parameter
        1,                  // Priority
        NULL,               // Task handle
        0                   // CORE 0 PINNING
    );

    Serial.printf("[READY] Real-Time Wireless TDMA running on Core %d.\n", xPortGetCoreID());
}

/* ====================================================================================================
 * 15. MAIN LOOP (CORE 1 - ZERO LATENCY DURING SMS DISPATCH)
 * ==================================================================================================== */
void loop() {
    uint32_t currentMillis = millis();

    // Master TDMA Beacon Broadcast (Strict 1000ms superframe)
    if (currentMillis - lastBeaconTxTime >= TDMA_FRAME_PERIOD_MS) {
        lastBeaconTxTime = currentMillis;
        broadcastTDMABeacon();
    }

    // Real-Time Non-Blocking Subsystems
    checkSerialCommands();
    updateStatusLEDs();
    handleBuzzerAlerts();
#if ENABLE_I2C_LCD
    updateLCDDisplay();
#endif
}
